Autodesk.Revit.DB.AnnotationMultipleAlignmentUtils.MoveWithAnchoredLeaders(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ)
Moves the element while keeping the leader end points anchored.
element:
The element to be moved.
moveVec:
The move vector for translating the element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element element does not support multiple alignment behavior.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to move element.
Since:
2025

Autodesk.Revit.DB.AnnotationMultipleAlignmentUtils.GetAnnotationOutlineWithoutLeaders(Autodesk.Revit.DB.Element)
Gets the four corners of the alignable element in model space without its leaders.
element:
The element for which we are retrieving the outline corners.
Returns:
The array of the four corner points for the alignable element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element element does not support multiple alignment behavior.
-or-
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.AnnotationMultipleAlignmentUtils.ElementSupportsMultiAlign(Autodesk.Revit.DB.Element)
Returns true if element can be aligned to other similar elements.
element:
The element to align.
Returns:
True if the element can be aligned using the multiple alignment commands, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.AnnotationMultipleAlignmentUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.AnnotationMultipleAlignmentUtils
A helper providing functionality related to elements that can be aligned to one another.
An element that wants to be able to align to other alignable elements using the Multiple Alignment buttons
should implement this helper class.
Since:
2025